#include <iostream>
#include "juju.h"

using namespace std;

class GearBox{
	public:
		void className(){
			cout<<"gearBox!"<<endl;			
		}
		virtual void owener(){
			cout<<"ROKBUS spó³ka akcyjna w Rokietnicy";
		}
		virtual void speak(){
			cout<<"brrrrrrrrrrrrrrrrrrrrrrrr brrrrr brrrrrrrr"<<endl;
		}
};
class Voith: public GearBox{
	public:
		void className(){
			cout<<"Type: voith"<<endl;
		}
		void owner(){
			cout<<"Owner: EL283 #8311"<<endl;
		}
		virtual void speak(){
			cout<<"Brzrzyyyyyyyyyy Brzyyey Brzyyyyyy Brzyyyy Brzyyyerwerwrwrw"<<endl;
		}
};

class Zf: public GearBox{
	public:
		void className(){
			cout<<"Type: Zf"<<endl;
		}
		void owner(){
			cout<<"Owner: NL263 #8315"<<endl;
		}
		void speak() override{
			cout<<"Ziuuuuu ziuuuu ziuuuuuu ziuuuuuuuuu ziuuuuuuuuuuuuuuuuuuuuuuuuu"<<endl;
		}
};
int main(){
	setlocale(LC_CTYPE,"polish");
	GearBox man;
	Voith *man8311 = new Voith();
	man8311->className();
	man8311->speak();
//Warto pamiêtaæ, ¿e: ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-ÐN+WX þ45•oB8x-›,>7M?¦¦¢¢37•0-
	return 8315;	
}	
